Repository: satorrwanda/firetrack360-fn
Catalog: lib/l10n/app_*.arb
Languages: rw

# onboardingTitle1
source: Welcome to FireTrack360
rw: Murakaza neza kuri FireSecure360

# onboardingDesc1
source: Secure your world, one tap at a time
rw: Rinda ibyaawe, Kanda Hano

# onboardingTitle2
source: Get Started
rw: Tangira

# onboardingDesc2
source: Create an account or log in to access all features
rw: Fungura konti cyangwa winjire kugira ngo ubone ibintu byose

# onboardingTitle3
source: Secure and Simple
rw: Umutekano n'Uburyo Bworoshye

# onboardingDesc3
source: Streamline your security management
rw: Gufasha imicungire y'umutekano wawe

source: Register
rw: Iyandikishe

source: Login
rw: Injira

# dontHaveAccountPrompt
source: Don't have an account?
rw: Ntabwo ufite konti?

# signUpLink
source: Sign Up
rw: Iyandikishe

# welcomeBackTitle
source: Welcome Back
rw: Murakaza neza

# signInToContinueSubtitle
source: Sign in to continue
rw: Injira kugirango ukomeze

# fillAllFieldsError
source: Please fill in all fields
rw: Uzuze ibibanza byose

# invalidEmailError
source: Please enter a valid email
rw: Andika imeyili yemewe

# loginFailedDefaultError
source: Login failed
rw: Kwinjira byanze

# emailVerificationRequiredError
source: Please verify your email before logging in
rw: Emeza imeyili yawe mbere yo kwinjira

# loginSuccessfulMessage
source: Login successful!
rw: Kwinjira byagenze neza!

# emailSaveFailedError
source: Failed to save email. Please try again.
rw: Gukoresha imeyili byanze. Ongera ugerageze.

# unexpectedError
source: An unexpected error occurred
rw: Habayeho ikibazo kitari giteganijwe

# emailHintText
source: Email Address
rw: Imeyili

# forgotPasswordLink
source: Forgot Password?
rw: Wibagiwe ijambo ry'ibanga?

# createAccountTitle
source: Create Account
rw: Fungura konti

# signUpToGetStartedSubtitle
source: Sign up to get started
rw: Iyandikishe kugirango utangire

# enterPhoneNumberError
source: Please enter your phone number
rw: Andika nimero ya telefone yawe

# rwandaPhoneNumberLengthError
source: Rwanda phone numbers must be 9 digits
rw: Nimero za telefone z'u Rwanda zigomba kugira imibare 9

# rwandaPhoneNumberStartError
source: Rwanda phone numbers must start with 7
rw: Nimero za telefone z'u Rwanda zigomba gutangira na 7

# phoneNumberMinLengthError
source: Phone number must be at least 9 digits
rw: Nimero ya telefone igomba kugira byibura imibare 9

# phoneNumberMaxLengthError
source: Phone number cannot exceed 10 digits
rw: Nimero ya telefone ntishobora kurenza imibare 10

# enterPasswordError
source: Please enter a password
rw: Andika ijambo ry'ibanga

# passwordHintText
source: Password
rw: Ijambo ry'ibanga

# passwordMinLengthError
source: Password must be at least 8 characters long
rw: Ijambo ry'ibanga rigomba kugira byibura inyuguti 8

# passwordUppercaseError
source: Password must contain at least one uppercase letter
rw: Ijambo ry'ibanga rigomba kugira byibura inyuguti nkuru imwe

# passwordLowercaseError
source: Password must contain at least one lowercase letter
rw: Ijambo ry'ibanga rigomba kugira byibura inyuguti nto imwe

# passwordDigitError
source: Password must contain at least one number
rw: Ijambo ry'ibanga rigomba kugira byibura umubare umwe

# passwordSpecialCharError
source: Password must contain at least one special character
rw: Ijambo ry'ibanga rigomba kugira byibura akamenyetso kamwe kidasanzwe

# confirmPasswordError
source: Please confirm your password
rw: Emeza ijambo ry'ibanga

# passwordsDoNotMatchError
source: Passwords do not match
rw: Amagambo y'ibanga ntabwo ahura

# phoneNumberLabel
source: Phone Number
rw: Nimero ya telefone

# searchCountryHint
source: Search country
rw: Shakisha igihugu

# confirmPasswordHintText
source: Confirm Password
rw: Emeza ijambo ry'ibanga

# emailAlreadyRegisteredError
source: This email is already registered. Please use a different email or try logging in.
rw: Iyi imeyili yamaze kwandikwa. Koresha indi imeyili cyangwa ugerageze kwinjira.

# checkInformationError
source: Please check your information and try again.
rw: Reba amakuru yawe maze ungerageze.

# invalidInputError
source: Invalid input. Please check your details.
rw: Ibyinjiye ntibikoze neza. Reba ibyo winjije.

# connectionError
source: Unable to connect to the server. Please check your internet connection.
rw: Ntushobora guhuza na seriveri. Reba interineti yawe.

# defaultError
source: An error occurred. Please try again.
rw: Habayeho ikibazo. Ongera ugerageze.

# successSnackBarTitle
source: Success
rw: Byagenze neza

# errorSnackBarTitle
source: Error
rw: Ikibazo

# dismissSnackBarAction
source: DISMISS
rw: Funga

# registrationSuccessDefaultMessage
source: Registration successful! Please verify your email with the OTP sent.
rw: Kwiyandikisha byagenze neza! Emeza imeyili yawe ukoresheje OTP yoherejwe.

# registrationFailedDefaultMessage
source: Registration failed. Please try again.
rw: Kwiyandikisha byaranze. Ongera ugerageze.

# unexpectedAuthError
source: An unexpected error occurred. Please try again later.
rw: Habayeho ikibazo kitari giteganijwe. Ongera ugerageze nyuma.

# loginFailedDefaultMessage
source: Login failed. Please try again.
rw: Kwinjira byaranze. Ongera ugerageze.

# resendOtpSuccessDefaultMessage
source: Verification code has been resent successfully.
rw: Kode yoherejwe bundi bushya.

# resendOtpFailedDefaultMessage
source: Failed to resend verification code. Please try again.
rw: Gusubiza kode byaranze. Ongera ugerageze.

# enterEmailError
source: Please enter your email address
rw: Andika imeyili yawe

# alreadyRegisteredPrompt
source: Already have an account?
rw: Usanzwe ufite konti?

# loginLink
source: Login
rw: Injira

# noEmailFoundError
source: No email found. Please log in again.
rw: Nta imeyili yabonetse. Nyamuneka ongera winjire.

# invalidEmailVerificationError
source: Invalid email. Please log in again.
rw: Imeyili ntiyemewe. Nyamuneka ongera winjire.

# errorRetrievingEmailError
source: Error retrieving email. Please log in again.
rw: Ikibazo mu gushaka imeyili. Nyamuneka ongera winjire.

# verificationGraphQLErrorDefault
source: An error occurred
rw: Habayeho ikibazo

# invalidLoginResponseError
source: Invalid login response
rw: Igisubizo cyo kwinjira nticikozeneza

# verificationFailedDefault
source: Verification failed
rw: Gushimangira byaranze

# unexpectedVerificationError
source: An unexpected error occurred: {error}
rw: Habayeho ikibazo kitari giteganijwe: {error}

# enterOtpError
source: Please enter the OTP
rw: Nyamuneka andika OTP

# otpLengthError
source: OTP must be 6 digits
rw: OTP igomba kugira imibare 6

# otpNumbersOnlyError
source: OTP must contain only numbers
rw: OTP igomba kugira imibare gusa

# verifyOtpTitle
source: Verify OTP
rw: Emeza OTP

# enterOtpMessage
source: Enter the verification code sent to {maskedEmail}
rw: Andika kode yoherejwe kuri {maskedEmail}

# otpHintText
source: Enter 6-digit OTP
rw: Andika OTP y'imibare 6

# verifyCodeButton
source: Verify Code
rw: Emeza Kode

# didNotReceiveCodePrompt
source: Didn't receive the code?
rw: Ntabwo wakiriye kode?

# resendLink
source: Resend
rw: Ongera wohereze

# futureBuilderErrorPrefix
source: Error:
rw: Ikibazo mu gushaka amakuru

# unexpectedPasswordResetVerificationError
source: An unexpected error occurred
rw: Habayeho ikibazo kitari giteganijwe mu kwemeza ijambo ry'ibanga rishya

# forgotPasswordTitle
source: Forgot Password
rw: Wibagiwe ijambo ry'ibanga

# enterEmailToResetPasswordSubtitle
source: Enter your email to reset password
rw: Andika imeyili yawe kugirango usubizeho ijambo ry'ibanga

# passwordResetOtpSentMessage
source: OTP to reset password has been sent to your email.
rw: OTP yo gusubiza ijambo ry'ibanga yoherejwe kuri imeyili yawe.

# resetPasswordButton
source: Reset Password
rw: Ohereza

# rememberPasswordPrompt
source: Remember your password?
rw: Wibuka ijambo ry'ibanga ryawe?

# signInLink
source: Sign In
rw: Injira

# resetPasswordTitle
source: Reset Password
rw: Ongera ushyireho ijambo ry'ibanga

# resetPasswordSubtitle
source: Enter your new password
rw: Injiza ijambo ry'ibanga rishya

# newPasswordHint
source: New Password
rw: Ijambo ry'ibanga rishya

# confirmPasswordHint
source: Confirm Password
rw: Emeza ijambo ry'ibanga

# passwordRequired
source: Please enter a password
rw: Nyamuneka andika ijambo ry'ibanga

# passwordLengthError
source: Password must be at least 8 characters long
rw: Ijambo ry'ibanga rigomba kuba rirenze inyuguti 8

# passwordNumberError
source: Password must contain at least one number
rw: Ijambo ry'ibanga rigomba kugira umubare

# passwordMismatchError
source: Passwords do not match
rw: Amajambo y'ibanga ntiyemewe

# passwordResetSuccess
source: Your password has been reset successfully
rw: Ijambo ry'ibanga ryawe ryongeweho neza

# termsAndConditionsText
source: By using this app, you agree to our Terms and Conditions
rw: Amategeko n'Amabwiriza

# termsPageTitle
source: Terms and Conditions
rw: Amategeko n'Amabwiriza

# errorLoadingTerms
source: Error loading terms and conditions. Please try again.
rw: Ikibazo mu gukurura amategeko n'amabwiriza

# errorLoadingPage
source: Error loading page. Please try again.
rw: Ntabwo kubona amakuru

# selectLanguageTitle
source: Select Language
rw: Hitamo Ururimi

# bottomNavHome
source: Home
rw: Ahabanza

# bottomNavProfile
source: Profile
rw: Umwirondoro

# bottomNavLanguage
source: Language
rw: Ururimi

# homePageTitle
source: Home
rw: Ahabanza

# welcomeBackSubtitle
source: Manage your fire safety equipment efficiently
rw: Cunga neza ibikoresho by'umutekano wo kwirinda inkongi y'umuriro

# quickActionsTitle
source: Quick Actions
rw: Ibikorwa Byihuse

# actionCardInventory
source: Inventory
rw: ububiko

# actionCardServices
source: Services
rw: Serivisi

# actionCardSettings
source: Settings
rw: Amahitamo

# actionCardNotifications
source: Notifications
rw: Ubutumwa

# actionCardNavigation
source: Navigation
rw: Kuyobora

# statusTitle
source: Status
rw: Imiterere

# roleLabel
source: Role
rw: Uruhare

# notificationsTooltip
source: Notifications
rw: Ubutumwa

# confirmLogoutTitle
source: Confirm Logout
rw: Emeza Gusohoka

# confirmLogoutMessage
source: Are you sure you want to sign out?
rw: Urifuza gusohoka?

# cancelButton
source: Cancel
rw: Kureka

# logoutButton
source: Logout
rw: Gusohoka

# drawerFeaturesTitle
source: FEATURES
rw: IBIKORWA

# drawerOtherTitle
source: OTHER
rw: IBINDI

# drawerItemDashboard
source: Dashboard
rw: Ahabanza

# drawerItemHome
source: Home
rw: Ahabanza

# drawerItemUsers
source: Users
rw: Abakozi

# drawerItemService
source: Service
rw: Serivisi

# drawerItemInventory
source: Inventory
rw: ububiko

# drawerItemNavigation
source: Navigation
rw: Kuyobora

# drawerItemProfile
source: Profile
rw: Umwirondoro

# drawerItemSettings
source: Settings
rw: Amahitamo

# drawerItemNotifications
source: Notifications
rw: Ubutumwa

# serviceRequestsTitle
source: Service Requests
rw: Serivisi

# refreshTooltip
source: Refresh
rw: Ongera utangire

# createServiceRequestTooltip
source: Create Service Request
rw: Kora icyifuzo cya Serivisi

# searchServiceRequestsHint
source: Search service requests...
rw: Shakisha serivisi...

source: Error loading service requests
rw: Ikibazo mu gufata serivisi

# retryButton
source: Retry
rw: Ongera ugerageze

source: No Service Requests Found
rw: Nta byifuzo bya Serivisi byabonetse

# adjustSearchOrFilters
source: Try adjusting your search or filters
rw: Gerageza guhindura uburyo bwo gushakisha cyangwa kugenwa

# columnTitle
source: TITLE
rw: SERIVISI

# columnStatus
source: STATUS
rw: Ahobigeze

# columnTechnician
source: TECHNICIAN
rw: TEKINISIYE

# columnDate
source: DATE
rw: ITALIKI

# columnActions
source: ACTIONS
rw: IBIKORWA

source: No technician assigned
rw: Nta wasanze wagenwe

# viewDetailsTooltip
source: View Details
rw: Reba ibisobanuro

# serviceRequestDetailsTitle
source: Service Request Details
rw: Serivisi Yasabwe

# requestInformationTitle
source: Request Information
rw: Amakuru kuri serivisi

# titleLabel
source: Title
rw: Umutwe

# statusLabel
source: Status
rw: Umwanzuro

# dateLabel
source: Date
rw: Italiki

# descriptionLabel
source: Description
rw: Ibisobanuro

# clientInformationTitle
source: Client Information
rw: Amakuru y'Umukiriya

# phoneLabel
source: Phone
rw: Nimero ya telefone

# technicianInformationTitle
source: Technician Information
rw: Amakuru y'umutekinisiye

# notAvailable
source: N/A
rw: Ntibibonetse

# closeButton
source: Close
rw: Funga

# showingRecords
source: Showing {startIndex}-{endIndex} of {totalCount}
rw: Erekana {startIndex}-{endIndex} muri {totalItems}

# rowsLabel
source: Rows:
rw: Imirongo:

# rowsPerPageLabel
source: Rows per page:
rw: Imirongo kuri buri rupapuro:

# statusPending
source: Pending
rw: Byategetswe

# statusInProgress
source: In Progress
rw: Birimo gukorwa

# statusCompleted
source: Completed
rw: Byarangiye

# statusCancelled
source: Cancelled
rw: Byavanyweho

# inventoryTitle
source: Inventory
rw: Ububiko

# productCreatedSuccess
source: Product created successfully
rw: Produit yakozwe neza

# errorCreatingProduct
source: Error creating product: {error}
rw: Ikibazo mu gukora produit : {error}

# deleteProductTitle
source: Delete Product
rw: Siba produit

# deleteProductConfirmation
source: Are you sure you want to delete {productName}?
rw: Wizeye ko ushaka gusiba {productName}?

# deleteButton
source: Delete
rw: Siba

# productDeletedSuccess
source: Product deleted successfully
rw: Produit yasibwe neza

# errorDeletingProduct
source: Error deleting product: {error}
rw: Ikibazo mu gusiba produit : {error}

# productUpdatedSuccess
source: Product updated successfully
rw: Produit yavuguruwe neza

# errorUpdatingProduct
source: Error updating product: {error}
rw: Ikibazo mu kuvugurura produit : {error}

# failedToRefresh
source: Failed to refresh: {error}
rw: Kunanirwa gufata : {error}

# newButton
source: New
rw: Gishya

# searchExtinguishersHint
source: Search extinguishers...
rw: Shakisha Kizimyamwoto...

# availableExtinguishersTitle
source: Available Extinguishers
rw: Kizimyamwoto zihari

# itemCount
source: {count, plural, =0{No items} one{{count} item} other{{count} items}}
rw: {count, plural, =0{Nta bikoresho bihari} one{{count} ikikoresho} other{{count} ibikoresho}}

source: No extinguishers available
rw: Nta Kizimyamwoto zihari

# noExtinguishersMatchSearch
source: No extinguishers match your search
rw: Nta Kizimyamwoto bijyanye n'ibyo ushakisha

# addExtinguisherButton
source: Add Extinguisher
rw: Ongeraho Kizimyamwoto

source: Unknown Type
rw: Ubwoko butazwi

# stockLabel
source: Stock: {quantity}
rw: Ububiko: {quantity}

# editTooltip
source: Edit
rw: Hindura

# deleteTooltip
source: Delete
rw: Siba

source: Error loading products
rw: Ikibazo mu gufata ibikoresho

# paginationPage
source: Page {currentPage} of {totalPages}
rw: Urupapuro {currentPage} rwa {totalPages}

# userManagementTitle
source: User Management
rw: Ubuyobozi bw'abakoresha

# userListRefreshed
source: User list refreshed successfully
rw: Amakuru y'abakoresha yabonetse

# addUserTooltip
source: Add User
rw: Ongeza umukozi

# searchUsersHint
source: Search users...
rw: Shakisha abakoresha...

# loadingMessage
source: Loading users...
rw: Gukura amakuru...

source: Error loading users
rw: Habayemo ikibazo

source: No users found
rw: Nta bakoresha babonetse

# noUsersMatchSearch
source: No users match your search
rw: Abo mwashatse ntabwo babonetse
